package com.hxjx.appliationplugin.lib.util;

import android.graphics.Color;

/**
 * author : openXu
 * create at : 2017/2/22 14:08
 * class describe：
 */
public class Constant {

    public static boolean debug = false;

    public static int[] CHARTCOLOR = new int[]{
            Color.argb(255,192, 0, 0), //第一条数据颜色	深红      192	0	0
            Color.argb(255,124, 20, 94), //第二条数据颜色	紫红色	 124	20	94
            Color.argb(255,255, 192, 0), //第三条数据颜色	橙色		255	192	0
            Color.argb(255,255, 255, 0), //第四条数据颜色	黄色		255	255	0
            Color.argb(255,0, 176, 80), //第五条数据颜色	绿色		0	176	80
            Color.argb(255,0, 112, 192), //第六条数据颜色	蓝色		0	112	192
            Color.argb(255,98, 41, 139), //第七条数据颜色	紫色		98	41	139
            Color.argb(255,232, 0, 124), //第八条数据颜色	品红		232	0	124
            Color.argb(255,198, 102, 79), //第九条数据颜色	土青色		198	102	79
            Color.argb(255,131, 131, 131), //第十条数据颜色	银白色		131	131	131

            //第二轮插件颜色色值
            Color.argb(255,255, 6, 6), //第十一条数据颜色	深红		255	6	6
            Color.argb(255,165, 27, 123), //第十二条数据颜色	紫红色		165	27	123
            Color.argb(255,255, 203, 45), //第十三条数据颜色	橙色		255	203	45
            Color.argb(255,255, 255, 26), //第十四条数据颜色	黄色		255	255	26
            Color.argb(255,0, 219, 99), //第十五条数据颜色	绿色		0	219	99
            Color.argb(255,0, 138, 240), //第十六条数据颜色	蓝色		0	138	240
            Color.argb(255,117, 50, 167), //第十七条数据颜色	紫色		117	50	167
            Color.argb(255,255, 15, 141), //第 十八条数据颜色	品红		255	15	141
            Color.argb(255,152, 130, 97), //第 十九条数据颜色	土青色		152	130	97
            Color.argb(255,147, 147, 147), //第 二十条数据颜色	银白色		147	147	147

            //第三轮插件颜色色值
            Color.argb(255,255, 38, 38), //第 二十一条数据颜色	深红		255	38	38
            Color.argb(255,207, 33, 155), //第 二十二条数据颜色	紫红色		207	33	155
            Color.argb(255,255, 214, 89), //第 二十三条数据颜色	橙色		255	214	89
            Color.argb(255,255, 255, 70), //第 二十四条数据颜色	黄色		255	255	70
            Color.argb(255,0, 255, 119), //第 二十五条数据颜色	绿色		0	255	119
            Color.argb(255,51, 168, 255), //第 二十六条数据颜色	蓝色		51	168	255
            Color.argb(255,150, 79, 202), //第 二十七条数据颜色	紫色		150	79	202
            Color.argb(255,255, 81, 172), //第 二十八条数据颜色	品红		255	81	172
            Color.argb(255,176, 158, 132), //第 二十九条数据颜色	土青色		176	158	132
            Color.argb(255,182, 182, 182), //第 三十条数据颜色	银白色		182	182	182
    };

}
